zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca80/pic32cz2051ca80176-pinctrl.h
/* pa23_gpio */
#define PA23_GPIO MCHP_PINMUX(a, 23, gpio, gpio)

/* pa23a_eic_extint7 */
#define PA23A_EIC_EXTINT7 MCHP_PINMUX(a, 23, a, periph)

/* pa23f_tcc7_wo1 */
#define PA23F_TCC7_WO1 MCHP_PINMUX(a, 23, f, periph)

/* pa24_gpio */
#define PA24_GPIO MCHP_PINMUX(a, 24, gpio, gpio)

/* pa24a_eic_extint8 */
#define PA24A_EIC_EXTINT8 MCHP_PINMUX(a, 24, a, periph)

/* pa24b_adc3_ain5 */
#define PA24B_ADC3_AIN5 MCHP_PINMUX(a, 24, b, periph)

/* pa25_gpio */
#define PA25_GPIO MCHP_PINMUX(a, 25, gpio, gpio)

/* pa25a_eic_extint9 */
#define PA25A_EIC_EXTINT9 MCHP_PINMUX(a, 25, a, periph)

/* pa25b_adc3_ain4 */
#define PA25B_ADC3_AIN4 MCHP_PINMUX(a, 25, b, periph)

/* pa26_gpio */
#define PA26_GPIO MCHP_PINMUX(a, 26, gpio, gpio)

/* pa26a_eic_extint10 */
#define PA26A_EIC_EXTINT10 MCHP_PINMUX(a, 26, a, periph)

/* pa26b_adc2_ain5 */
#define PA26B_ADC2_AIN5 MCHP_PINMUX(a, 26, b, periph)

/* pa27_gpio */
#define PA27_GPIO MCHP_PINMUX(a, 27, gpio, gpio)

/* pa27a_eic_extint11 */
#define PA27A_EIC_EXTINT11 MCHP_PINMUX(a, 27, a, periph)

/* pa27b_adc2_ain4 */
#define PA27B_ADC2_AIN4 MCHP_PINMUX(a, 27, b, periph)

/* pa28_gpio */
#define PA28_GPIO MCHP_PINMUX(a, 28, gpio, gpio)

/* pa28a_eic_extint12 */
#define PA28A_EIC_EXTINT12 MCHP_PINMUX(a, 28, a, periph)

/* pa28b_adc1_ain5 */
#define PA28B_ADC1_AIN5 MCHP_PINMUX(a, 28, b, periph)

/* pa29_gpio */
#define PA29_GPIO MCHP_PINMUX(a, 29, gpio, gpio)

/* pa29a_eic_extint13 */
#define PA29A_EIC_EXTINT13 MCHP_PINMUX(a, 29, a, periph)

/* pa29b_adc1_ain4 */
#define PA29B_ADC1_AIN4 MCHP_PINMUX(a, 29, b, periph)

/* pa30_gpio */
#define PA30_GPIO MCHP_PINMUX(a, 30, gpio, gpio)

/* pa30a_eic_extint14 */
#define PA30A_EIC_EXTINT14 MCHP_PINMUX(a, 30, a, periph)

/* pa30j_spi_ixs1_fsync */
#define PA30J_SPI_IXS1_FSYNC MCHP_PINMUX(a, 30, j, periph)

/* pa31_gpio */
#define PA31_GPIO MCHP_PINMUX(a, 31, gpio, gpio)

/* pa31a_eic_extint15 */
#define PA31A_EIC_EXTINT15 MCHP_PINMUX(a, 31, a, periph)

/* pa31j_spi_ixs1_mclk1 */
#define PA31J_SPI_IXS1_MCLK1 MCHP_PINMUX(a, 31, j, periph)

/* pb0_gpio */
#define PB0_GPIO MCHP_PINMUX(b, 0, gpio, gpio)

/* pb0a_eic_extint0 */
#define PB0A_EIC_EXTINT0 MCHP_PINMUX(b, 0, a, periph)

/* pb0b_ac_ain1 */
#define PB0B_AC_AIN1 MCHP_PINMUX(b, 0, b, periph)

/* pb0b_adc0_ain3 */
#define PB0B_ADC0_AIN3 MCHP_PINMUX(b, 0, b, periph)

/* pb1_gpio */
#define PB1_GPIO MCHP_PINMUX(b, 1, gpio, gpio)

/* pb1a_eic_extint1 */
#define PB1A_EIC_EXTINT1 MCHP_PINMUX(b, 1, a, periph)

/* pb1b_ac_ain0 */
#define PB1B_AC_AIN0 MCHP_PINMUX(b, 1, b, periph)

/* pb1b_adc0_ain2 */
#define PB1B_ADC0_AIN2 MCHP_PINMUX(b, 1, b, periph)

/* pb2_gpio */
#define PB2_GPIO MCHP_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 MCHP_PINMUX(b, 2, a, periph)

/* pb2b_adc0_ain1 */
#define PB2B_ADC0_AIN1 MCHP_PINMUX(b, 2, b, periph)

/* pb3_gpio */
#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

/* pb3b_adc0_ain0 */
#define PB3B_ADC0_AIN0 MCHP_PINMUX(b, 3, b, periph)

/* pb4_gpio */
#define PB4_GPIO MCHP_PINMUX(b, 4, gpio, gpio)

/* pb4a_eic_extint4 */
#define PB4A_EIC_EXTINT4 MCHP_PINMUX(b, 4, a, periph)

/* pb5_gpio */
#define PB5_GPIO MCHP_PINMUX(b, 5, gpio, gpio)

/* pb5a_eic_extint5 */
#define PB5A_EIC_EXTINT5 MCHP_PINMUX(b, 5, a, periph)

/* pb6_gpio */
#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

/* pb6p_ptc_drv11 */
#define PB6P_PTC_DRV11 MCHP_PINMUX(b, 6, p, periph)

/* pb7_gpio */
#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 MCHP_PINMUX(b, 7, a, periph)

/* pb7p_ptc_drv10 */
#define PB7P_PTC_DRV10 MCHP_PINMUX(b, 7, p, periph)

/* pb8_gpio */
#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

/* pb8p_ptc_drv9 */
#define PB8P_PTC_DRV9 MCHP_PINMUX(b, 8, p, periph)

/* pb9_gpio */
#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 MCHP_PINMUX(b, 9, a, periph)

/* pb9p_ptc_drv8 */
#define PB9P_PTC_DRV8 MCHP_PINMUX(b, 9, p, periph)

/* pb10_gpio */
#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 MCHP_PINMUX(b, 10, a, periph)

/* pb10f_tcc1_wo0 */
#define PB10F_TCC1_WO0 MCHP_PINMUX(b, 10, f, periph)

/* pb10p_ptc_drv7 */
#define PB10P_PTC_DRV7 MCHP_PINMUX(b, 10, p, periph)

/* pb11_gpio */
#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 MCHP_PINMUX(b, 11, a, periph)

/* pb11f_tcc1_wo1 */
#define PB11F_TCC1_WO1 MCHP_PINMUX(b, 11, f, periph)

/* pb11p_ptc_drv6 */
#define PB11P_PTC_DRV6 MCHP_PINMUX(b, 11, p, periph)

/* pb12_gpio */
#define PB12_GPIO MCHP_PINMUX(b, 12, gpio, gpio)

/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 MCHP_PINMUX(b, 12, a, periph)

/* pb12f_tcc1_wo2 */
#define PB12F_TCC1_WO2 MCHP_PINMUX(b, 12, f, periph)

/* pb12p_ptc_drv5 */
#define PB12P_PTC_DRV5 MCHP_PINMUX(b, 12, p, periph)

/* pb13_gpio */
#define PB13_GPIO MCHP_PINMUX(b, 13, gpio, gpio)

/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 MCHP_PINMUX(b, 13, a, periph)

/* pb13f_tcc1_wo3 */
#define PB13F_TCC1_WO3 MCHP_PINMUX(b, 13, f, periph)

/* pb13p_ptc_drv4 */
#define PB13P_PTC_DRV4 MCHP_PINMUX(b, 13, p, periph)

/* pb14_gpio */
#define PB14_GPIO MCHP_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 MCHP_PINMUX(b, 14, a, periph)

/* pb14f_tcc1_wo4 */
#define PB14F_TCC1_WO4 MCHP_PINMUX(b, 14, f, periph)

/* pb14p_ptc_drv3 */
#define PB14P_PTC_DRV3 MCHP_PINMUX(b, 14, p, periph)

/* pb15_gpio */
#define PB15_GPIO MCHP_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 MCHP_PINMUX(b, 15, a, periph)

/* pb15f_tcc1_wo5 */
#define PB15F_TCC1_WO5 MCHP_PINMUX(b, 15, f, periph)

/* pb15p_ptc_drv2 */
#define PB15P_PTC_DRV2 MCHP_PINMUX(b, 15, p, periph)

/* pb16_gpio */
#define PB16_GPIO MCHP_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 MCHP_PINMUX(b, 16, a, periph)

/* pb16f_tcc1_wo6 */
#define PB16F_TCC1_WO6 MCHP_PINMUX(b, 16, f, periph)

/* pb16p_ptc_drv1 */
#define PB16P_PTC_DRV1 MCHP_PINMUX(b, 16, p, periph)

/* pb17_gpio */
#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 MCHP_PINMUX(b, 17, a, periph)

/* pb17f_tcc1_wo7 */
#define PB17F_TCC1_WO7 MCHP_PINMUX(b, 17, f, periph)

/* pb17p_ptc_drv0 */
#define PB17P_PTC_DRV0 MCHP_PINMUX(b, 17, p, periph)

/* pb18_gpio */
#define PB18_GPIO MCHP_PINMUX(b, 18, gpio, gpio)

